src/DataProcessors/АБ_РазовогоПримененияПослеПереноса_ОчиститьДанныеДляРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>АБ_РазовогоПримененияПослеПереноса_ОчиститьДанныеДляРасчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/СведенияОВремениДляРасчетаСреднегоОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СведенияОВремениДляРасчетаСреднегоОбщий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПорядокРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРасчетаСреднегоЗаработкаОбщий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/АБ_РазовогоПримененияПослеПереноса_ОчиститьДанныеДляРасчета/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ОчиститьРСДляСреднегоОбщий(Команда)
	ОчиститьРСДляСреднегоОбщийНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьРСДляСреднегоОбщийНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Сотрудник КАК Сотрудник,
	               |	ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Месяц КАК Месяц,
	               |	ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.ПорядокРасчета КАК ПорядокРасчета
	               |ИЗ
	               |	РегистрСведений.ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка КАК ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Месяц, МЕСЯЦ) >= &ДатаНачала
	               |	И НАЧАЛОПЕРИОДА(ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Месяц, МЕСЯЦ) <= &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Объект.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Объект.ДатаОкончания));
	Результат = Запрос.Выполнить();
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи=РегистрыСведений.ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка,"Сотрудник,Месяц,ПорядокРасчета");
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьРС_СведенияНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Сотрудник КАК Сотрудник,
	               |	ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Месяц КАК Месяц,
	               |	ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.ПорядокРасчета КАК ПорядокРасчета
	               |ИЗ
	               |	РегистрСведений.СведенияОВремениДляРасчетаСреднегоОбщий КАК ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Месяц, МЕСЯЦ) >= &ДатаНачала
	               |	И НАЧАЛОПЕРИОДА(ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Месяц, МЕСЯЦ) <= &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Объект.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Объект.ДатаОкончания));
	Результат = Запрос.Выполнить();
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи=РегистрыСведений.СведенияОВремениДляРасчетаСреднегоОбщий.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка,"Сотрудник,Месяц,ПорядокРасчета");
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();
	КонецЦикла;

// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРС_Сведения(Команда)
	ОчиститьРС_СведенияНаСервере();
КонецПроцедуры
